In [2]:
import pandas as pd

## Reading csv file from absolute path 

Absolute path means the path of csv file is different from the path where this jupyter notebook is running 

that is present working directory

so we need to specify the path which contain this csv file

Check Below the present working directory of this notebook and the directory of the csv file both are different.

In [11]:
pwd

'C:\\Users\\ckp43_000\\Py_DS_CKP\\Python_DataScience\\Pandas'

In [ ]:
csv_file_path='D:/My_small_CSV_File/mythirdcsv.csv'

In [6]:
df=pd.read_csv('D:/My_small_CSV_File/mythirdcsv.csv')

In [7]:
df

  Unnamed: 0    name  marks1  marks2        city
0      first   harry      92     109      rampur
1     second   rohan      34      89     kolkata
2      third  skillf     200      45   bareilley
3     fourth    subh      17      78  antarctica

In [10]:
df.columns

Index(['Unnamed: 0', 'name', 'marks1', 'marks2', 'city'], dtype='object')

In [16]:
new_df=df.drop(['city'],axis=1)

In [17]:
new_df

  Unnamed: 0    name  marks1  marks2
0      first   harry      92     109
1     second   rohan      34      89
2      third  skillf     200      45
3     fourth    subh      17      78

In [25]:
new_df.to_csv('new_thirdcsv.csv',index=False)

In [26]:
pd.read_csv('C:/Users/ckp43_000/Py_DS_CKP/Python_DataScience/Pandas/new_thirdcsv.csv')

  Unnamed: 0    name  marks1  marks2
0      first   harry      92     109
1     second   rohan      34      89
2      third  skillf     200      45
3     fourth    subh      17      78

In [3]:
html_data=pd.read_html('https://www.fdic.gov/Bank/individual/failed/banklist.html')

In [4]:
html_data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [6]:
html_data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [9]:
type(html_data)

list

In [10]:
html_data

[                             Bank Name           City  ST   CERT  \
 0                 The First State Bank  Barboursville  WV  14361
 1                   Ericson State Bank        Ericson  NE  18265
 2     City National Bank of New Jersey         Newark  NJ  21111
 3                        Resolute Bank         Maumee  OH  58317
 4                Louisa Community Bank         Louisa  KY  58112
 ..                                 ...            ...  ..    ...
 556                 Superior Bank, FSB       Hinsdale  IL  32646
 557                Malta National Bank          Malta  OH   6629
 558    First Alliance Bank & Trust Co.     Manchester  NH  34264
 559  National State Bank of Metropolis     Metropolis  IL   3815
 560                   Bank of Honolulu       Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                         MVB Bank, Inc.      April 3, 2020
 1             Farmers and Merchants Bank  February 14, 2020
 2                        Industrial Bank   November 1, 2019
 3                     Buckeye State Bank   October 25, 2019
 4      Kentucky Farmers Bank Corporation   October 25, 2019
 ..                                   ...                ...
 556                Superior Federal, FSB      July 27, 2001
 557                    North Valley Bank        May 3, 2001
 558  Southern New Hampshire Bank & Trust   February 2, 2001
 559              Banterra Bank of Marion  December 14, 2000
 560                   Bank of the Orient   October 13, 2000

 [561 rows x 6 columns]]